Revit 2021.1 API
RebarSystemSpanSymbol Properties
The RebarSystemSpanSymbol type exposes the following members.
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
HasElbow
 Whether the tag's leader has an elbow point or not.
 (Inherited from IndependentTag.)
HasLeader
 Whether the tag has a leader or not.
 (Inherited from IndependentTag.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsMaterialTag
 Identifies if it is a material tag or not.
 (Inherited from IndependentTag.)
IsMulticategoryTag
 Identifies if it is a multi-category tag or not.
 (Inherited from IndependentTag.)
IsOrphaned
 Identifies if the tag is orphaned or not.
 (Inherited from IndependentTag.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LeaderElbow
 The position of the elbow of the tag's leader.
 (Inherited from IndependentTag.)
LeaderEnd
 The position of the leader end for a tag using free end leader behavior.
 (Inherited from IndependentTag.)
LeaderEndCondition
 The leader end condition of the tag, such as if the end of the leader is attached to the host or free floating.
 (Inherited from IndependentTag.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
MultiReferenceAnnotationId
 The multi-reference annotation which owns this tag.
 (Inherited from IndependentTag.)
Name
A human readable name for the Element.
 (Inherited from Element.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
TaggedElementId
 The LinkElementId of the tagged element. If the tag is tagged on a subelement of linked element, it returns the LinkElementId of the element.
 (Inherited from IndependentTag.)
TaggedLocalElementId
 The ID of the tagged local element, if any. If the tag is tagged on a subelement of local element, it returns the element ID.
 (Inherited from IndependentTag.)
TagHeadPosition
 The position of the head of tag in model coordinates.
 (Inherited from IndependentTag.)
TagOrientation
 The tag orientation of the tag's head, such as horizontal or vertical.
 (Inherited from IndependentTag.)
TagText
 The text associated with the tag. If there are several strings assiciated with the tag, the strings will be returned concatenated.
 (Inherited from IndependentTag.)
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
VersionGuid
 Get the element version Guid.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
RebarSystemSpanSymbol Class
Autodesk.Revit.DB.Structure Namespace